# SetTextureSet

## Description
Sets the texture set of an object.

```pascal
PROCEDURE SetTextureSet(
				object     : HANDLE;
				textureSet : INTEGER);
```

```python

def vs.SetTextureSet(object, textureSet):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object.|
|textureSet|INTEGER|           The texture set.            0 - Object textures           1 - Component textures         |

## See Also
VS Functions:
GetTextureSet

## Version
Availability: from Vectorworks 2011
## Category
* Textures